In [3]:
import pandas as pd
import os

### Exploring the Genome Movies dataset

In [16]:
cwd = os.getcwd()
movies_df = pd.read_csv(os.getcwd()+"/data/ml-20m/movies.csv").sort_values(by="movieId")
movies_df.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

### Exploring the Ratings dataset

In [17]:
ratings_df = pd.read_csv(os.getcwd()+"/data/ml-20m/ratings.csv").sort_values(by="movieId")
ratings_df.head()

          userId  movieId  rating   timestamp
14162882   97809        1     3.0  1213159631
15347420  106140        1     5.0  1359430429
15347355  106138        1     3.0  1028130533
10170195   70354        1     4.5  1297623340
10170255   70355        1     3.5  1201366614

### Exploring the tags dataset

In [19]:
tags_df = pd.read_csv(os.getcwd()+"/data/ml-20m/tags.csv").sort_values(by="movieId")
tags_df.head()

        userId  movieId         tag   timestamp
358938  110148        1  friendship  1422605756
42994    10616        1   animation  1277357417
42993    10616        1    animated  1277357419
42992    10616        1   adventure  1277357423
134542   35984        1   animation  1152405430

### Exploring the Genome scores dataset

In [8]:
genome_scores_df = pd.read_csv(os.getcwd()+"/data/ml-20m/genome-scores.csv",nrows=100)
genome_scores_df.head()

   movieId  tagId  relevance
0        1      1    0.02500
1        1      2    0.02500
2        1      3    0.05775
3        1      4    0.09675
4        1      5    0.14675

### Exploring the Genome tags dataset

In [9]:
genome_tags_df = pd.read_csv(os.getcwd()+"/data/ml-20m/genome-tags.csv",nrows=100)
genome_tags_df.head()

   tagId           tag
0      1           007
1      2  007 (series)
2      3  18th century
3      4         1920s
4      5         1930s

### Exploring the links dataset

In [10]:
links_df = pd.read_csv(os.getcwd()+"/data/ml-20m/links.csv",nrows=100)
links_df.head()

   movieId  imdbId  tmdbId
0        1  114709     862
1        2  113497    8844
2        3  113228   15602
3        4  114885   31357
4        5  113041   11862